In [38]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [39]:
def create_server_connection(host_name,user_name,user_password):
    connection=None
    try:
        connection=mysql.connector.connect(host=host_name,user=user_name,passwd=user_password)
        print('mysql database connection successful')
    except Error as err:
        print(f"Error:'{err}'")
    return connection

In [40]:
pw='okigotit09'
db='operations_research'
connection=create_server_connection('localhost','root',pw)

mysql database connection successful

In [28]:
def create_database(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        print("database created successfully")
    except Error as err:
        print(f"Error:'{err}'")
        
create_database_query='Create database operations_research'
create_database(connection,create_database_query)

Error:'1007 (HY000): Can't create database 'operations_research'; database exists'

In [36]:
#connect to the database
def create_db_connection(host_name,user_name,user_password,db_name):
    connection=None
    try:
        connection=mysql.connector.connect(host=host_name,user=user_name,passwd=user_password,database=db_name)
        print('mysql database connection successful')
    except Error as err:
        print(f"Error:'{err}'")
    return connection

In [37]:
#execute sql query
def execute_query(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successful")
    except Error as err:
        print(f"Error:'{err}'")

In [31]:
create_orders_table="""
create table final_reviews(
reviews varchar(3000) not null
);
"""

In [32]:
#connect to the database
connection=create_db_connection('localhost','root',pw,db)
execute_query(connection,create_orders_table)

mysql database connection successful
Query was successful

In [22]:
#insert data
data_orders="""
insert into final_reviews 
values(101,'shamim','laptop','2018-05-29',2,800,'01784365872'),
(102,'sadd','tv','2018-05-29',2,800,'018651620138'),
(103,'hasna','radio','2018-05-29',2,400,'05252013893')

"""
connection=create_db_connection('localhost','root',pw,db)
execute_query(connection,data_orders)

mysql database connection successful
Error:'1146 (42S02): Table 'operations_research.orders' doesn't exist'

In [10]:
def read_query(connection,query):
    cursor=connection.cursor()
    result=None
    try:
        cursor.execute(query)
        result=cursor.fetchall()
        return result
    except Error as err:
        print(f"Error:'{err}'")

In [11]:
#select_statement
q1='''
select *
from orders
limit 2;

'''

In [12]:
connection=create_db_connection('localhost','root',pw,db)
results=read_query(connection,q1)
for result in results:
    print(result)

mysql database connection successful
(101, 'shamim', 'laptop', datetime.date(2018, 5, 29), 2, 800.0, '01784365872')
(102, 'tanju', 'tv', datetime.date(2018, 5, 29), 2, 800.0, '01882013893')

In [13]:
from_db=[]
for result in results:
    result=list(result)
    from_db.append(result)
columns=['order_id','customer_name','product_name','data_ordered','quantity','unit_price','phone_number']
df=pd.DataFrame(from_db,columns=columns)
display(df)

,order_id,customer_name,product_name,data_ordered,quantity,unit_price,phone_number
0,101,shamim,laptop,2018-05-29,2,800.0,01784365872
1,102,tanju,tv,2018-05-29,2,800.0,01882013893

In [14]:
q2='''
update orders
set unit_price=500 where order_id=102;
'''

In [15]:
connection=create_db_connection('localhost','root',pw,db)
execute_query(connection,q2)

mysql database connection successful
Query was successful

In [16]:
connection=create_db_connection('localhost','root',pw,db)
results=read_query(connection,q1)
for result in results:
    print(result)

mysql database connection successful
(101, 'shamim', 'laptop', datetime.date(2018, 5, 29), 2, 800.0, '01784365872')
(102, 'tanju', 'tv', datetime.date(2018, 5, 29), 2, 500.0, '01882013893')